<?php

return [
    'accepted' => 'يجب قبول الحقل.',
    'accepted_if' => 'يجب قبول الحقل عندما يكون :other هو :value.',
    'active_url' => 'يجب أن يكون الحقل عنوان URL صالحًا.',
    'after' => 'يجب أن يكون الحقل تاريخًا بعد :date.',
    'after_or_equal' => 'يجب أن يكون الحقل تاريخًا بعد أو يساوي :date.',
    'alpha' => 'يجب أن يحتوي الحقل على أحرف فقط.',
    'alpha_dash' => 'يجب أن يحتوي الحقل على أحرف وأرقام وشرطات وشرطات تحتية فقط.',
    'alpha_num' => 'يجب أن يحتوي الحقل على أحرف وأرقام فقط.',
    'array' => 'يجب أن يكون الحقل مصفوفة.',
    'ascii' => 'يجب أن يحتوي الحقل على أحرف أبجدية أحادية بايت ورموز فقط.',
    'before' => 'يجب أن يكون الحقل تاريخًا قبل :date.',
    'before_or_equal' => 'يجب أن يكون الحقل تاريخًا قبل أو يساوي :date.',
    'between' => [
        'array' => 'يجب أن يحتوي الحقل على عدد بين :min و :max عنصر.',
        'file' => 'يجب أن يكون حجم الحقل بين :min و :max كيلوبايت.',
        'numeric' => 'يجب أن يكون الحقل بين :min و :max.',
        'string' => 'يجب أن يكون الحقل بين :min و :max حرف.',
    ],
    'boolean' => 'يجب أن يكون الحقل صحيحًا أو خاطئًا.',
    'confirmed' => 'تأكيد كلمة المرور غير متطابق',
    'current_password' => 'كلمة المرور غير صحيحة.',
    'date' => 'يجب أن يكون الحقل تاريخًا صالحًا.',
    'date_equals' => 'يجب أن يكون الحقل تاريخًا يساوي :date.',
    'date_format' => 'يجب أن يتطابق الحقل مع التنسيق :format.',
    'decimal' => 'يجب أن يحتوي الحقل على :decimal عدد من الأماكن العشرية.',
    'declined' => 'يجب رفض الحقل.',
    'declined_if' => 'يجب رفض الحقل عندما يكون :other هو :value.',
    'different' => 'يجب أن يكون الحقل و :other مختلفين.',
    'digits' => 'يجب أن يكون الحقل :digits أرقام.',
    'digits_between' => 'يجب أن يكون الحقل بين :min و :max أرقام.',
    'dimensions' => 'يحتوي الحقل على أبعاد صورة غير صالحة.',
    'distinct' => 'الحقل يحتوي على قيمة مكررة.',
    'doesnt_end_with' => 'يجب أن لا ينتهي الحقل بأحد القيم التالية: :values.',
    'doesnt_start_with' => 'يجب أن لا يبدأ الحقل بأحد القيم التالية: :values.',
    'email' => 'يجب أن يكون الحقل عنوان بريد إلكتروني صالح.',
    'ends_with' => 'يجب أن ينتهي الحقل بأحد القيم التالية: :values.',
    'enum' => 'القيمة المحددة لـ :attribute غير صالحة.',
    'exists' => 'موجود بالفعل',
    'file' => 'يجب أن يكون الحقل ملفًا.',
    'filled' => 'يجب أن يحتوي الحقل على قيمة.',
    'gt' => [
        'array' => 'يجب أن يحتوي الحقل على أكثر من :value عنصر.',
        'file' => 'يجب أن يكون حجم الحقل أكبر من :value كيلوبايت.',
        'numeric' => 'يجب أن يكون الحقل أكبر من :value.',
        'string' => 'يجب أن يكون الحقل أكبر من :value حرف.',
    ],
    'gte' => [
        'array' => 'يجب أن يحتوي الحقل على :value عنصرًا أو أكثر.',
        'file' => 'يجب أن يكون حجم الحقل أكبر من أو يساوي :value كيلوبايت.',
        'numeric' => 'يجب أن يكون الحقل أكبر من أو يساوي :value.',
        'string' => 'يجب أن يكون الحقل أكبر من أو يساوي :value حرفًا.',
    ],
    'image' => 'يجب أن يكون الحقل صورة.',
    'in' => 'القيمة المحددة لـ :attribute غير صالحة.',
    'in_array' => 'يجب أن يكون الحقل موجودًا في :other.',
    'integer' => 'يجب أن يكون الحقل عددًا صحيحًا.',
    'ip' => 'يجب أن يكون الحقل عنوان IP صالحًا.',
    'ipv4' => 'يجب أن يكون الحقل عنوان IPv4 صالحًا.',
    'ipv6' => 'يجب أن يكون الحقل عنوان IPv6 صالحًا.',
    'json' => 'يجب أن يكون الحقل سلسلة JSON صالحة.',
    'lowercase' => 'يجب أن يكون الحقل في حالة صغيرة.',
    'lt' => [
        'array' => 'يجب أن يحتوي الحقل على أقل من :value عنصر.',
        'file' => 'يجب أن يكون حجم الحقل أقل من :value كيلوبايت.',
        'numeric' => 'يجب أن يكون الحقل أقل من :value.',
        'string' => 'يجب أن يكون الحقل أقل من :value حرف.',
    ],
    'lte' => [
        'array' => 'يجب أن لا يحتوي الحقل على أكثر من :value عنصر.',
        'file' => 'يجب أن يكون حجم الحقل أقل من أو يساوي :value كيلوبايت.',
        'numeric' => 'يجب أن يكون الحقل أقل من أو يساوي :value.',
        'string' => 'يجب أن يكون الحقل أقل من أو يساوي :value حرفًا.',
    ],
    'mac_address' => 'يجب أن يكون الحقل عنوان MAC صالحًا.',
    'max' => [
        'array' => 'يجب أن لا يحتوي الحقل على أكثر من :max عنصر.',
        'file' => 'يجب أن لا يكون حجم الحقل أكبر من :max كيلوبايت.',
        'numeric' => 'يجب أن لا يكون الحقل أكبر من :max.',
        'string' => 'يجب أن لا يكون الحقل أكبر من :max حرف.',
    ],
    'max_digits' => 'يجب أن لا يحتوي الحقل على أكثر من :max رقم.',
    'mimes' => 'يجب أن يكون الحقل ملفًا من النوع: :values.',
    'mimetypes' => 'يجب أن يكون الحقل ملفًا من النوع: :values.',
    'min' => [
        'array' => 'يجب أن يحتوي الحقل على الأقل على :min عنصر.',
        'file' => 'يجب أن يكون حجم الحقل على الأقل :min كيلوبايت.',
        'numeric' => 'يجب أن يكون الحقل على الأقل :min.',
        'string' => 'يجب أن يكون الحقل على الأقل :min حرفًا.',
    ],
    'min_digits' => 'يجب أن يحتوي الحقل على الأقل على :min أرقام.',
    'missing' => 'يجب أن يكون الحقل مفقودًا.',
    'missing_if' => 'يجب أن يكون الحقل مفقودًا عندما يكون :other هو :value.',
    'missing_unless' => 'يجب أن يكون الحقل مفقودًا ما لم يكن :other هو :value.',
    'missing_with' => 'يجب أن يكون الحقل مفقودًا عندما يكون :values موجودًا.',
    'missing_with_all' => 'يجب أن يكون الحقل مفقودًا عندما تكون :values موجودة.',
    'multiple_of' => 'يجب أن يكون الحقل مضاعفًا لـ :value.',
    'not_in' => 'القيمة المحددة لـ :attribute غير صالحة.',
    'not_regex' => 'تنسيق الحقل غير صالح.',
    'numeric' => 'يجب أن يكون الحقل رقمًا.',
    'password' => [
        'letters' => 'يجب أن يحتوي الحقل على حرف واحد على الأقل.',
        'mixed' => 'يجب أن يحتوي الحقل على حرف كبير وحرف صغير على الأقل.',
        'numbers' => 'يجب أن يحتوي الحقل على رقم واحد على الأقل.',
        'symbols' => 'يجب أن يحتوي الحقل على رمز واحد على الأقل.',
        'uncompromised' => ':attribute المعطى قد ظهر في تسريب بيانات. يرجى اختيار :attribute مختلف.',
    ],
    'present' => 'يجب أن يكون الحقل حاضرًا.',
    'prohibited' => 'الحقل ممنوع.',
    'prohibited_if' => 'الحقل ممنوع عندما يكون :other هو :value.',
    'prohibited_unless' => 'الحقل ممنوع ما لم يكن :other في :values.',
    'prohibits' => 'الحقل يمنع :other من الوجود.',
    'regex' => 'تنسيق الحقل غير صحيح.',
    'required' => 'الحقل مطلوب.',
    'required_array_keys' => 'يجب أن يحتوي الحقل على مفاتيح لـ :values.',
    'required_if' => 'الحقل مطلوب عندما يكون :other هو :value.',
    'required_if_accepted' => 'الحقل مطلوب عندما يكون :other مقبولًا.',
    'required_unless' => 'الحقل مطلوب ما لم يكن :other في :values.',
    'required_with' => 'الحقل مطلوب عندما يكون :values موجودًا.',
    'required_with_all' => 'الحقل مطلوب عندما تكون :values موجودةً جميعًا.',
    'required_without' => 'الحقل مطلوب عندما لا يكون :values موجودًا.',
    'required_without_all' => 'الحقل مطلوب عندما لا تكون :values موجودةً جميعًا.',
    'same' => 'يجب أن يتطابق الحقل مع :other.',
    'size' => [
        'array' => 'يجب أن يحتوي الحقل على :size عنصرًا.',
        'file' => 'يجب أن يكون حجم الحقل :size كيلوبايت.',
        'numeric' => 'يجب أن يكون الحقل :size.',
        'string' => 'يجب أن يكون الحقل :size حرفًا.',
    ],
    'starts_with' => 'يجب أن يبدأ الحقل بأحد القيم التالية: :values.',
    'string' => 'يجب أن يكون الحقل نصًا.',
    'timezone' => 'يجب أن يكون الحقل منطقة زمنية صحيحة.',
    'unique' => 'تم اتخاذه بالفعل.',
    'uploaded' => 'فشل في الرفع.',
    'uppercase' => 'يجب أن يكون الحقل في الحالة الكبيرة.',
    'url' => 'يجب أن يكون الحقل عنوان URL صحيحًا.',
    'ulid' => 'يجب أن يكون الحقل ULID صحيحًا.',
    'uuid' => 'يجب أن يكون الحقل UUID صحيحًا.',
    'invalid' => 'الحقل غير صالح',
    'taken' => 'الحقل مأخوذ بالفعل',
    'wrong_credentials' => 'بيانات اعتماد خاطئة',
    'validation_errors' => 'أخطاء التحقق',
    'success' => 'نجاح',
    'error' => 'خطأ',
    'not_found' => 'غير موجود',
    'not_exists' => 'لا يوجد',
    'project' => [
        'price' => 'أكبر من سعر المشروع',
        'completed' => 'انتهت تاريخ الانتهاء',
    ],
    'quantity' => [
        'bigger' => 'أكبر من الموجود وهو ',
    ],
    'wrong' => 'غير صحيح',
    'captcha' => 'غير صالح',
    'inactive' => 'غير نشط',
    'custom_distinct' => 'الحقل يحتوي على قيم مكررة',
    'banned' => 'محظور',
    'active' => 'نشط الآن',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],
    'not_verified' => 'is not verified',
    'frozen' => 'account is frozen',
    'not_match' => 'Not Match',
];
